backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - null
      - 24
      - 1
      dtype: float32
      name: time_distributed_input
      ragged: false
      sparse: false
  - class_name: TimeDistributed
    config:
      batch_input_shape: !!python/tuple
      - null
      - null
      - 24
      - 1
      dtype: float32
      layer:
        class_name: Conv1D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          dtype: float32
          filters: 64
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          name: conv1d
          padding: valid
          strides: !!python/tuple
          - 1
          trainable: true
          use_bias: true
      name: time_distributed
      trainable: true
  - class_name: TimeDistributed
    config:
      dtype: float32
      layer:
        class_name: Conv1D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          dtype: float32
          filters: 64
          groups: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          name: conv1d_1
          padding: valid
          strides: !!python/tuple
          - 1
          trainable: true
          use_bias: true
      name: time_distributed_1
      trainable: true
  - class_name: TimeDistributed
    config:
      dtype: float32
      layer:
        class_name: MaxPooling1D
        config:
          data_format: channels_last
          dtype: float32
          name: max_pooling1d
          padding: valid
          pool_size: !!python/tuple
          - 2
          strides: !!python/tuple
          - 2
          trainable: true
      name: time_distributed_2
      trainable: true
  - class_name: TimeDistributed
    config:
      dtype: float32
      layer:
        class_name: Flatten
        config:
          data_format: channels_last
          dtype: float32
          name: flatten
          trainable: true
      name: time_distributed_3
      trainable: true
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      dtype: float32
      go_backwards: false
      implementation: 2
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: lstm
      recurrent_activation: sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config:
          gain: 1.0
          seed: null
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      time_major: false
      trainable: true
      unit_forget_bias: true
      units: 100
      unroll: false
      use_bias: true
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout
      noise_shape: null
      rate: 0.5
      seed: null
      trainable: true
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 100
      use_bias: true
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 3
      use_bias: true
  name: sequential
keras_version: 2.4.0
